

predPrefix = {
        "на/над": "кэ-",
        "под": "тэ-",
        "за": "хиа-",
        "перед": "хаи-",
        "справа": "иар-",
        "слева": "аир-",
        "сзади": "аиха-",
        "для": "диа-",
        "в": "вои-",
        "вне": "вэи-",
        "от": "тэа-",
        "к": "пэ-",
        "с": "эа-",
        "по": "оис-"
    }
# добваить приедлоги для твоего, твоей, моей и тд
mestPrefx = {
    "я": "сиа",
    "ты": "ниа",
    "он": "миа",
    "она": "миа",
    "оно": "гиа",
    "мы": "симиа",
    "вы": "нимиа",
    "они": "мимиа",
    "себя": "химиа"

}

chastrechiPrist = {
    "сущ": "сай-",
    "прил": "пай-",
    "гл": "гай-",
    "нар": "зай-"
}

dicts = [predPrefix]